wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2378/nic_bsp.c
#define  MAIN_OSC_FRQ              12000000L
#define  IRC_OSC_FRQ               12000000L
#define  RTC_OSC_FRQ                  32768L


INT32U  bsp_cpu_clk_freq (void)
{
	INT32U  msel;
	INT32U  nsel;
	INT32U  fin;
	INT32U  pll_clk_feq;                                    /* When the PLL is enabled, this is Fcco                    */
	INT32U  clk_div;
	INT32U  clk_freq;

	switch (CLKSRCSEL & 0x03)
	{                                 /* Determine the current clock source                       */
		case 0:
			fin        =  IRC_OSC_FRQ;
			break;
		case 1:
			fin        =  MAIN_OSC_FRQ;
			break;
		case 2:
			fin        =  RTC_OSC_FRQ;
			break;
		default:
			fin        =  IRC_OSC_FRQ;
			break;
	}

	if ((PLLSTAT & (1 << 25)) > 0) 
	{                                                              /* If the PLL is currently enabled and connected        */
		msel        = (INT32U)(PLLSTAT & 0x3FFF) + 1;           /* Obtain the PLL multiplier                            */
		nsel        = (INT32U)((PLLSTAT >>   16) & 0x0F) + 1;   /* Obtain the PLL divider                               */
		pll_clk_feq = (2 * msel * fin / nsel);                      /* Compute the PLL output frequency                     */
	} 
	else
	{
		pll_clk_feq = (fin);                                        /* The PLL is bypassed                                  */
	}

	clk_div         = (INT8U)(CCLKCFG & 0x0F) + 1;             /* Obtain the CPU core clock divider                    */
	clk_freq        = (INT32U)(pll_clk_feq / clk_div);          /* Compute the ARM Core clock frequency                 */

	return (clk_freq);
}
 
void rt_delayms(INT32U ms)
{
	//执行11059200次语句，花时3.570S，差不多每ms计算3097条语句
	INT32U count=3339*ms;
	INT32U i;
	for (i=0;i<count;i++)
	{
		__asm{ NOP };
	}
}


void  nic_int_init  (void)
{
 //	rt_hw_interrupt_install(VIC_ETHERNET, nic_isr_handler, RT_NULL);
 //	rt_hw_interrupt_umask(VIC_ETHERNET);

	VICIntSelect       &= ~(1 << VIC_ETHERNET);                         /* Configure the Ethernet VIC interrupt source for IRQ      */
	VICVectAddr21       =  (CPU_INT32U)nic_isr_handler;              /* Set the vector address                                   */
	VICIntEnable        =  (1 << VIC_ETHERNET);                         /* Enable the VIC interrupt source, but no local sources    */
}
 
/* ethernet device interface */
INT8U IsTxDescFull( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 
	
	if (TxConsumeIndex == (TxProduceIndex+1)%NUM_TX_FRAG)
	{	
		return TRUE;	
	}
	return FALSE;
}
INT8U IsTxDescEmpty( )
{
	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (TxConsumeIndex == TxProduceIndex)
	{
		return OS_TRUE;
	}

	return OS_FALSE;
}
 
#define   MIN(x, y)   ((x)   >   (y)   ?   (y)   :   (x)) 
INT16U lpc24xxether_write_frame( struct pbuf* p )
{
	struct pbuf* q;
	INT8U *pDescBuf = NULL;
	INT8U *pSrcBuf = NULL;
	INT16U nTxBufOffset = 0,nDescOffset = 0,nPduLen = 0,nSendLen = 0;

	INT32U TxProduceIndex = MAC_TXPRODUCEINDEX;
	INT32U TxConsumeIndex = MAC_TXCONSUMEINDEX;	 

	if (p == NULL)
		return 0;
 
	pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;

	for (q = p; q != NULL; q = q->next)
	{
		nTxBufOffset = 0;
		if (q && q->len)
		{
			pSrcBuf = (INT8U*) q->payload;

			while( nTxBufOffset < q->len )
			{
				nPduLen = MIN(ETH_FRAG_SIZE-nDescOffset,q->len-nTxBufOffset);
				if (nPduLen)
				{
					memcpy(&pDescBuf[nDescOffset], &pSrcBuf[nTxBufOffset], nPduLen );
					nSendLen += nPduLen;

					if (nSendLen >= p->tot_len)
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_LAST       |        /* No additional descriptors to follow, this is the last    */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}
					else
					{
						tb_descriptors[TxProduceIndex].Ctrl =  (EMAC_TX_DESC_OVERRIDE   |        /* Override the defaults from the MAC internal registers    */
							EMAC_TX_DESC_PAD        |        /* Add padding for frames < 64 bytes                        */
							EMAC_TX_DESC_CRC)       |        /* Append the CRC automatically                             */
							(nPduLen + nDescOffset- 1);                       /* Write the size of the frame, starting from 0             */
					}

					nTxBufOffset += nPduLen;
					nDescOffset += nPduLen;
				
					//更新
					if (nDescOffset >= ETH_FRAG_SIZE )
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						pDescBuf = (INT8U *)tb_descriptors[TxProduceIndex].Packet;
					}
					else if (nSendLen >= p->tot_len)
					{
						TxProduceIndex ++;
						if (TxProduceIndex >= NUM_TX_FRAG)
						{
							TxProduceIndex -= NUM_TX_FRAG;
						}
						break;
					}
				}
			}
		}							   
	}
	MAC_TXPRODUCEINDEX = TxProduceIndex;
}
/*
* Transmit packet.
*/ 
 
INT8U lpc24xxether_tx( eth_device_t dev, struct pbuf* p)
{
	struct pbuf* q;
	INT8U err = OS_NO_ERR;

	SetLedBlinking(1,1,0);
// 	err = IsTxDescEmpty();
// 	if (err == FALSE)
// 	{
// 		return 0;
// 	}
// 	while(!IsTxDescEmpty())
// 	{
// 		OSTimeDly(5);
// 	}

	/* lock tx operation */
//	rt_sem_take(&tx_sem, RT_WAITING_FOREVER);
	OSSemPend(tx_sem,0,&err);
	lpc24xxether_write_frame (p);
	OSSemPost(tx_sem);

	return 0;
}
/*
*********************************************************************************************************
*                                         NIC_RxGetNRdy()
*
* Description : Determines how many packets we are ready to be processed.
*
* Parameters  : None.
*
* Returns     : Number of NIC buffers that are ready to be processed by the stack.
*********************************************************************************************************
*/ 
static  INT16U  get_rx_pkt_cnt (void)
{
	INT16U     n_rdy;
	INT16U     rxconsumeix;
	INT16U     rxproduceix;

	rxconsumeix =   MAC_RXCONSUMEINDEX;
	rxproduceix =   MAC_RXPRODUCEINDEX;

