wmy2370cn/nxp-lpc/trunk/NXP-LPC/V7/Bsp/LPC2378/nic_bsp.c
	INT32U RxProduceIndex = MAC_RXPRODUCEINDEX;
	INT32U RxConsumeIndex = MAC_RXCONSUMEINDEX;	 

	struct pbuf* q;
	INT16U  pkt_len = 0;
	INT16U  pkt_cnt = 0;
	INT8U   ret = OS_FALSE;
	
	if (RxProduceIndex == RxConsumeIndex)
		return RT_NULL;
// 	while(RxProduceIndex == RxConsumeIndex  )
//  { //缓冲区为空，继续等待
// 		rt_thread_delay(5);
// 		RxProduceIndex = MAC_RXPRODUCEINDEX;
// 		RxConsumeIndex = MAC_RXCONSUMEINDEX;	 
// 	}
 	 
	pkt_len = get_nic_rx_frame_size();
//	pkt_len = get_nic_rx_pkt_size();
	//判断一下 pkt_len 是否有效，如果无效，则丢弃
	 ret = NetIF_IsValidPktSize(pkt_len);
	 if (ret == OS_FALSE)
	 {
		 EMAC_RxPktDiscard();
		 return NULL;
	 }
 
	 SetLedBlinking(2,1,0);
	//
	if (pkt_len)
	{
		p = pbuf_alloc(PBUF_RAW, pkt_len, PBUF_POOL);
		if(p != RT_NULL)
		{
			for(q = p; q != RT_NULL; q= q->next)
				lpc24xxether_read_frame(q->payload, q->len, pkt_len);
		}
		else
		{//如果内存申请不到，那么需要对描述符进行处理，扔掉部分数据包
			//rt_kprintf("no memory in pbuf\n");
			 EMAC_RxPktDiscard();
			 SetLedBlinking(7,5,0);

		}
	}
 
	return p;
}

void update_mac_address(struct rt_lpc24xx_eth* device)
{
	MAC_SA0 = (device->dev_addr[5] << 8) | (device->dev_addr[4]);
	MAC_SA1 = (device->dev_addr[3] << 8)  | (device->dev_addr[2]);
	MAC_SA2 = (device->dev_addr[1] << 8)  | (device->dev_addr[0]);
}


/*********************************************************************************************************
** 函数名称: lpc24xxether_register
** 函数名称: lpc24xxether_register
**
** 功能描述：  注册MAC设备
**
** 输　入:  char * name
**          
** 输　出:   int
**         
** 全局变量:  
** 调用模块: 无
**
** 作　者:  LiJin
** 日　期:  2009年7月30日
** 备  注:  
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 备  注: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
int lpc24xxether_register(char *name)
{
 	INT8U result;	   
	/* init rt-thread device interface */
  	lpc24xx_device.parent.eth_rx			= lpc24xxether_rx;
  	lpc24xx_device.parent.eth_tx			= lpc24xxether_tx; 

	tx_sem = OSSemCreate(1);
//	rt_sem_init(&tx_sem, "emac", 1, RT_IPC_FLAG_FIFO);
	//与协议栈相关
	result = eth_device_init(& (lpc24xx_device.parent) , (char*)name);
	RT_ASSERT(result == OS_TRUE);
	//MAC PHY硬件的初始化
	lpc24xxether_init( & lpc24xx_device );
	return OS_TRUE;
}
INT8U SetHWAddr( INT8U *pAddr )
{
	if (pAddr)
	{
		memcpy(pAddr,lpc24xx_device.dev_addr, 6);
	}
}


void rt_hw_eth_init()
{
    AppInitTCPIP();
	lpc24xxether_register("E0");	 
}

